import img1 from '../../public/images/boxes/boxes_section/box.jpg';
import img2 from '../../public/images/boxes/boxes_section/box2.jpg';
import img3 from '../../public/images/boxes/boxes_section/boxes3.jpg';
import { BoxDetailsI } from '../types';

export const getBoxDetails = async (id: string): Promise<BoxDetailsI> => {
  try {
    await new Promise(resolve => setTimeout(resolve, 1000));

    const fakeBoxDetails: BoxDetailsI = {
      id: '1',
      images: [img1.src, img2.src, img3.src],
      title: 'Бокс - Мінімал',
      price: ' 355,00 ',
      aroma: [
        'Чиста бавовна',
        'Кориця і ваніль',
        'Свіжа кава',
        'Гарбуз зі спеціями',
        'Пелюстки троянд',
        'Сухий джин',
        'Грейпфрут і м’ята',
        'Свіжа кава',
      ],
      components: [
        'Тара на 30 мл',
        'Віск',
        'Аромаолія ( на вибір)',
        'Деревяний гніт',
        'Тримач для гноту ',
      ],
      description:
        'Ласкаво просимо на сторінку, де ваша   творчість запалюється , а натхнення вибу- хає на повну ! Тут ви знайдете наші захоп- люючі бокси для створення своїх власних шедеврів свічок. Ми підготували для вас набори, які містять все необхідне: відбір найкращих матеріалів до вимоги у виборі дизайну. Ласкаво просимо на сторінку, де ваша творчість запалюється , а натхнення вибу- хає на повну ! Тут ви знайдете наші захоп- люючі бокси для створення своїх власних шедеврів свічок. Ми підготували для вас набори, які містять все необхідне: відбір найкращих матеріалів до вимоги у виборі дизайну.  Ласкаво просимо на сторінку, де ваша творчість запалюється , а натхнення вибухає на повну ! Тут ви знайдете наші захоплюючі бокси для створення своїх власних шедеврів свічок. Ми підготували для вас набори, які містять все необхідне: відбір найкращих матеріалів до вимоги у виборі дизайну.',
      similar: [
        {
          id: '11',
          image: img1.src,
          title: 'Кориця та вапніль. ',
          price: '370,00',
        },
      ],
    };

    return fakeBoxDetails;
  } catch (error) {
    throw error;
  }
};
